## Exercise 1.02: Create Pandas Series to form a DataFrame

#### 1. Import numpy and pandas package

In [2]:
import pip
try:
    import numpy 
except ImportError:
     pip.main(['install', 'numpy']) 

try:
    import pandas  
except ImportError:
     pip.main(['install', 'pandas'])

#### 2. Generate random numbers

In [3]:
numpy.random.seed(0)
random_number = numpy.random.random(10)

random_number

array([0.5488135 , 0.71518937, 0.60276338, 0.54488318, 0.4236548 ,
       0.64589411, 0.43758721, 0.891773  , 0.96366276, 0.38344152])

#### 3. Set random_number variable to Series and assign it to variable s

In [4]:
s = pandas.Series(random_number)
print(s)

0    0.548814
1    0.715189
2    0.602763
3    0.544883
4    0.423655
5    0.645894
6    0.437587
7    0.891773
8    0.963663
9    0.383442
dtype: float64

In [5]:
print(type(s))
print(type(random_number))

<class 'pandas.core.series.Series'>
<class 'numpy.ndarray'>

In [6]:
print(s[2])

0.6027633760716439

#### 4.  Observe what happens when we include an index

In [26]:
index_value = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
s = pandas.Series(random_number, index=index_value)
print(s)

a    0.548814
b    0.715189
c    0.602763
d    0.544883
e    0.423655
f    0.645894
g    0.437587
h    0.891773
i    0.963663
j    0.383442
dtype: float64

### Exercise 1.2a:  Create set of lists or Series and stack them as a DataFrame

#### 1. Create four Series of the same lengths

In [27]:
s1 = pandas.Series([1, 2, 3, 4, 5])
s2 = pandas.Series([6, 7, 8, 9, 10])
s3 = pandas.Series([11, 12, 13, 14, 15])
s4 = pandas.Series([16, 17, 18, 19, 20])

#### 2. Stack them into DataFrame:

In [30]:
df = pandas.DataFrame({'s1':s1, 's2':s2, 's3':s3, 's4':s4})
df

   s1  s2  s3  s4
0   1   6  11  16
1   2   7  12  17
2   3   8  13  18
3   4   9  14  19
4   5  10  15  20

### Exercise 3: Download dataset from World Bank Open data to demonstrate how Pandas read file into a DataFrame

#### 1. Use pandas read_csv() to csv file into variable called temp_aus_df

In [7]:
temp_aus_df =pandas.read_csv("tas_1991_2016_AUS.csv")

#### 2. Use Pandas head function to print the first few rows of the DataFrame, temp_aus_df

In [32]:
temp_aus_df.head()

   Temperature - (Celsius)   Year  Month     Country  ISO3
0                  28.2684   1991    Jan   Australia   AUS
1                  27.9415   1991    Feb   Australia   AUS
2                  25.7541   1991    Mar   Australia   AUS
3                  22.2463   1991    Apr   Australia   AUS
4                  18.4007   1991    May   Australia   AUS

#### 3. Use Pandas tail function to print the last  few rows of the DataFrame, temp_aus_df

In [33]:
temp_aus_df.tail()

     Temperature - (Celsius)   Year  Month     Country  ISO3
307                  16.1341   2016    Aug   Australia   AUS
308                  18.8000   2016    Sep   Australia   AUS
309                  22.0308   2016    Oct   Australia   AUS
310                  25.7045   2016    Nov   Australia   AUS
311                  27.5676   2016    Dec   Australia   AUS

#### 4.  What total number of records/rows/observations of the dataframe?

In [40]:
len(temp_aus_df)

312

#### 5. what are the datatypes of the columns in the dataframe?

In [41]:
temp_aus_df.dtypes

Temperature - (Celsius)    float64
 Year                        int64
 Month                      object
 Country                    object
 ISO3                       object
dtype: object

#### 6. How many missing values in the dataframe?

In [42]:
temp_aus_df.isnull().sum()

Temperature - (Celsius)    0
 Year                      0
 Month                     0
 Country                   0
 ISO3                      0
dtype: int64

#### 7. Replace missing values in DataFrame

In [8]:
for colname in temp_aus_df.columns:
    if  df[colname].dtype == 'object':
        df[colname] =temp_aus_df[colname].fillna('others')
    else:
        temp_aus_df[colname] = temp_aus_df[colname].fillna(0)

NameError: name 'df' is not defined

In [ ]:
temp_aus_df.to_csv(‘newdata.csv’, index=False)